<?php

// Fatal error
//Фатальна помилка виникає тоді коли викликається невідома функція
fatalFunction();


//Parse error
//Синтаксична помилка виникає, коли є синтаксичні порушення, наприклад не поставлена крапка з комою
echo 'Hello World'


//Warning
//Попередження яке не зупиняє скрипт, викликається тоді коли намагаєшся підключити файл який неіснує
include 'unrnow_file';


//Notice
//Повідомлення викинає тоді коли використуваєш не оголошену змінну
echo $undefinedVariables;


//Deprecated
//Повідомлення виникає тоді коли використуваєш функцію яка застаріла
$array = [1, 2, 4];
$element = each($array);


//Exception
//Виключення використовується для обробки помилок, скрипт працювати буде тому що його було оброблено в блоці catch
try {
    $result = 10/0;
    echo $result;
} catch (DivisionByZeroError $exception) {
    echo 'Виникла помилка: '  . $exception->getMessage();
}