<?php
//Задача: Написати скрипт на PHP, який обчислює загальну вартість покупок у кошику.
// Кожен товар у кошику представлений асоціативним масивом з ключами
// name (назва товару), price (ціна за одиницю) і quantity (кількість).
// Скрипт повинен вивести список товарів з їх загальною вартістю і загальну вартість усіх товарів у кошику.
//

$cart = [
    ['name' => 'Apple', 'price' => 1.2, 'quantity' => 10],
    ['name' => 'Banana', 'price' => 0.8, 'quantity' => 5],
    ['name' => 'Orange', 'price' => 1.5, 'quantity' => 7],
    ['name' => 'Milk', 'price' => 3.5, 'quantity' => 2],
    ['name' => 'Bred', 'price' => 0.9, 'quantity' => 2],
    ['name' => 'Beer', 'price' => 1.6, 'quantity' => 4],
];
$total = 0;
foreach ($cart as $item){
    echo $item['name'] . ': $' ;
    echo $item['price'] * $item['quantity'] . PHP_EOL;
    $total += $item['price'] * $item['quantity'];
}
echo 'Total' . ': $' .$total . PHP_EOL;

//Очікуваний результат:
//bash
//Apple: $12.00
//Banana: $4.00
//Milk: $10.50
//Bred: $10.50
//Beer: $10.50
//Total: $26.50


//Задача: Написати скрипт на PHP, який створює зворотний список чисел від 10 до 1,
// використовуючи цикл for Скрипт повинен вивести цей масив у вигляді рядка чисел, розділених комами.
//
//Очікуваний результат:

//10, 9, 8, 7, 6, 5, 4, 3, 2, 1

for ($x = 10; $x >= 1; $x--) {
    echo $x;
    if ($x != 1) {
        echo ', ';
    } else {
        echo PHP_EOL;
    }
}


//Задача: Написати скрипт на PHP, який виведе всі парні числа від 1 до 20 включно, використовуючи цикл while.
// Кожне парне число повинно бути виведене на новій стрічці.
//
//Очікуваний результат:
//Copy code
//2
//4
//6
//8
//10
//12
//14
//16
//18
//20











